<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>1. Introdu&ccedil;&atilde;o</title><meta name="generator" content="DocBook XSL-NS Stylesheets V1.74.0"><link rel="home" href="index.html" title="Access por Resultados - 1&ordm; Tutorial Boas vindas ao MS Access"><link rel="up" href="index.html" title="Access por Resultados - 1&ordm; Tutorial Boas vindas ao MS Access"><link rel="prev" href="index.html" title="Access por Resultados - 1&ordm; Tutorial Boas vindas ao MS Access"><link rel="next" href="ar01s02.html" title="2. Sistema de Gerenciamento de Bancos de Dados - SGBD"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">1. Introdu&ccedil;&atilde;o</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">Anterior</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ar01s02.html">Pr&oacute;ximo</a></td></tr></table><hr></div><div class="section" lang="pt"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d4e21"></a>1. Introdu&ccedil;&atilde;o</h2></div></div></div>
    

    <p>Usar o MS Access &eacute; desafiante, mas prazeiroso!</p>

    <p>A interface do programa n&atilde;o se parece com outras que estamos
    mais habituados, como o <span class="trademark">MS Excel</span>&#8482; e o <span class="trademark">MS
    Word</span>&#8482;.</p>

    <p>Por&eacute;m &eacute; o mais pr&oacute;ximo que o usu&aacute;rio possa chegar do programador; em
    outras palavras, pode-se chegar mais longe ainda do que estamos
    acostumados com os editores e planilhas comuns, automatizando tabelas,
    consultas e relat&oacute;rios, e melhor, reaproveitando-os.</p>

    <p>Nos aventuramos nessa s&eacute;rie de tutoriais tentando incut&iacute;-lhe o
    prazer de usar essa ferramenta: MS Access.</p>

    <p>O MS Access &eacute; um banco de dados fabuloso, com um repert&oacute;rio de
    recursos vast&iacute;ssimos - v&aacute;rios por n&oacute;s ainda sendo descobertos...</p>

    <p>Seus benef&iacute;cios para o nosso dia a dia s&atilde;o in&uacute;meros, e no
    caso espec&iacute;fico da Opera&ccedil;&atilde;o Ecf, &uacute;nica alternativa que encontramos,
    frente algumas circunst&acirc;ncias...</p>

    <p>O limite de linhas de uma planilha no MS Excel &eacute; facilmente
    alcan&ccedil;ado devido ao tamanho dos arquivos gerados pelo programa eECFc
    (usado pela fiscaliza&ccedil;&atilde;o nas leituras dos equipamentos Emissores de
    Cupons Fiscais).</p>

    <p>A administra&ccedil;&atilde;o de in&uacute;meros e enormes arquivos &eacute; a
    oportunidade de usar recursos de um banco de dados.</p>

    <p>Como dito, pode-se reutilizar planilhas, consultas, tabelas e
    relat&oacute;rios no MS Access; pode-se importar artefatos de outros bancos de
    dados, ou seja, reaproveitar esfor&ccedil;os, evitando o retrabalho, ou
    &#8220;<span class="quote">reinventar a roda!</span>&#8221;. Nada de rotinas como
    <span class="guimenuitem">selecionar / copiar / colar / modificar</span> que nos
    levam facilmente a erros. Nada de redigitar dados em editores de texto:
    nossos dados s&atilde;o guardados em banco de dados uma &uacute;nica vez e
    s&atilde;o reutiliz&aacute;veis e inseridos nos lugares certos em relat&oacute;rios,
    etiquetas... voc&ecirc; escolhe!</p>

    <p>Apreender a melhor t&eacute;cnica exige determina&ccedil;&atilde;o, interesse e
    disciplina. Estamos prontos para aprimorarmos nossa solu&ccedil;&atilde;o
    mediante sugest&otilde;es. Voc&ecirc; tem uma p&aacute;gina web
    (http://code.google.com/p/accessbyresults/) ao seu inteiro dispor;
    M&atilde;os &agrave; obra; Interaja j&aacute; !</p>

    <p>Esse trabalho visa incentivar o uso MS Access.</p>

    <p>Entramos diretamente no ponto: os exemplos ser&atilde;o extra&iacute;dos do
    nosso dia a dia, especificamente da opera&ccedil;&atilde;o ECF.</p>

    <p>Pouca teoria; definimos o que queremos e implementamos a
    solu&ccedil;&atilde;o.</p>

    <p>Apreender as t&eacute;cnicas direcionando-nos para resultados.</p>

    <p>Access por resultado!</p>
  </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">Anterior</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ar01s02.html">Pr&oacute;ximo</a></td></tr><tr><td width="40%" align="left" valign="top">Access por Resultados - 1&ordm; Tutorial Boas vindas ao
    MS Access&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">In&iacute;cio</a></td><td width="40%" align="right" valign="top">&nbsp;2. Sistema de Gerenciamento de Bancos de Dados - SGBD</td></tr></table></div></body></html>